Norlander/STM32F429I-DISCO_WS2812B_Cube/Src/main.c
	SetAllLedsColor(SPIBufBlue);

	HAL_Delay(DELAY);

	SetAllLedsColor(SPIBufClear);

	HAL_Delay(DELAY);

	ClearAllLeds();

	HAL_Delay(DELAY);

	LEDSiren();

	HAL_Delay(DELAY);

	ClearAllLeds();

	HAL_Delay(DELAY);

	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);

	HAL_Delay(DELAY);

	HAL_SPI_Transmit(&hspi3, SPIBufRed, sizeof(SPIBufRed), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufRed, sizeof(SPIBufRed), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufRed, sizeof(SPIBufRed), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufRed, sizeof(SPIBufRed), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufRed, sizeof(SPIBufRed), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);

	HAL_Delay(DELAY);

	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);

	HAL_Delay(DELAY);

	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufGreen, sizeof(SPIBufGreen), 10);

	HAL_Delay(DELAY);

	HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufBlue, sizeof(SPIBufBlue), 10);

	HAL_Delay(DELAY);

	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);
	HAL_SPI_Transmit(&hspi3, SPIBufClear, sizeof(SPIBufClear), 10);

#endif

	//	HAL_Delay(DELAY);
	//
	//	HAL_SPI_Transmit(&hspi3, &SPIBufReset, 1, 10);

	HAL_Delay(DELAY);
	//HAL_SPI_Transmit(&hspi3, SPIBufRed, sizeof(SPIBufRed), 10);
	// Ger hard fault...
	SetAllLedsGreenMain();


	while (1)
	{

		while( 0 == BSP_PB_GetState(BUTTON_KEY) )
		{
			HAL_GPIO_DeInit(GPIOB, GPIO_PIN_4);
		}

		HAL_Delay(100);

		if (LEDState < NROFSTATES) {
			LEDState++;

		}
		else
		{
			LEDState = 0;
		}

		switch (LEDState) {
		case RedState:
			SetAllLedsGreenMain(&hspi3, SPIBufGreen);
			break;
		default:
			break;
		}
	}
}

/** System Clock Configuration
 */
void SystemClock_Config(void)
{

	RCC_OscInitTypeDef RCC_OscInitStruct;
	RCC_ClkInitTypeDef RCC_ClkInitStruct;

	/**Configure the main internal regulator output voltage
	 */
	__HAL_RCC_PWR_CLK_ENABLE();

	__HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSI;
	RCC_OscInitStruct.HSIState = RCC_HSI_ON;
	RCC_OscInitStruct.HSICalibrationValue = 16;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSI;
	RCC_OscInitStruct.PLL.PLLM = 8;
	RCC_OscInitStruct.PLL.PLLN = 160;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 7;
	if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}

	/**Initializes the CPU, AHB and APB busses clocks
	 */
	RCC_ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK|RCC_CLOCKTYPE_SYSCLK
			|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;

	if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5) != HAL_OK)
	{
		_Error_Handler(__FILE__, __LINE__);
	}

	/**Configure the Systick interrupt time
	 */
	HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

	/**Configure the Systick
	 */
	HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

	/* SysTick_IRQn interrupt configuration */
	HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

/* ADC1 init function */
void MX_ADC1_Init(void)
{

